{
    "versions": [
        ["3.0.0", {
            "messageEn": "• Added popup window. The window contains the current playlist and player control buttons. The window can be set to different sizes, both very small and large. The window can save position and size if it is set in the settings. In the settings, you can reassign one key combination for opening, bringing to the front and minimizing the window. (The popup only works correctly in 'Google Chrome', other popular Chrome-based browsers may have errors). <br>• Now you can turn on notifications to see how the song changes every time. <br>• In notifications, the track icon has rounded corners.",
            "messageRu": "• Добавлено всплывающее окно. Окно содержит текущий плейлист и кнопки управления плеером. Окну можно задать разные размеры, как очень маленькое, так и большое. Окно может сохранять положение и размер, если это установлено в настройках. В настройках можно переназначить одну комбинацию клавиш для открытия, вывода на передний план и сворачивания окна. (Всплывающее окно корректно работает только в 'Google Chrome', в других популярных браузерах на базе Chrome могут возникать ошибки). <br>• Теперь вы можете включить уведомления что бы каждый раз видеть смену композиции. <br>• В уведомлениях иконка трека имеет скругленные углы."
        }],
        ["2.4.0", {
            "messageEn": "• Now the «dislike» button is available on the main screen (enable in the settings). Also now you can long press the «like» button to dislike a track. Works on the main screen and in the playlist.",
            "messageRu": "• Теперь на главном экране доступна кнопка «дизлайка» (включается в настройках). Также теперь при долгом нажатии кнопки «нравится», трек больше не будет появляться в ваших рекомендациях (дизлайк). Работает на главном экране и в плейлисте."
        }],
        ["2.3.0", {
            "messageEn": "• Added dark theme. <br> • Improved the displayed track list if your current playlist type is radio. Now you can see next 5-7 tracks.",
            "messageRu": "• Добавлена темная тема.<br> • Улучшен отображаемый список треков, если ваш текущий тип плейлиста — радио. Теперь вы можете увидеть следующие 5-7 треков."
        }],
        ["2.2.0", {
            "messageEn": "•Toggles available! <br> Now you can control the volume, repeat and shuffle the music. <br> • You can also increase or decrease the volume and rewind the track with the mouse wheel!",
            "messageRu": "• Доступны переключатели! <br> Теперь вы можете регулировать громкость, повторять и перемешивать музыку. <br> • Вы также можете увеличивать или уменьшать громкость и перематывать трек колесиком мыши!"
        }],
        ["2.1.0", {
            "messageEn": "• The playlist now shows which track has been added to favorites.",
            "messageRu": "• В плейлисте теперь отображается, какой трек был добавлен в избранное."
        }],
        ["2.0.0", {
            "messageEn": "• Added a list of tracks of the current playlist. <br> Also you can select track from playlist.",
            "messageRu": "• Добавлен список треков текущего плейлиста. <br> Также вы можете выбрать трек из плейлиста."
        }],
        ["1.5.7-9", {
            "messageEn": "• Bugs fixed.",
            "messageRu": "• Исправлены ошибки."
        }],
        ["1.5.6", {
            "messageEn": "• Improved rewind!",
            "messageRu": "• Улучшена перемотка!"
        }],
        ["1.5", {
            "messageEn": "• You can now rewind the track.<br>• Click on the notification to skip to the next track!",
            "messageRu": "• Теперь вы можете перемотать трек.<br>• Нажмите на уведомление, чтобы перейти к следующему треку!"
        }],
        ["1.4", {
            "messageEn": "• Added Integrate with Windows and Linux operating systems, tested on: Windows 10, Kubuntu 20.04.<br>• Added settings for control show notifications.",
            "messageRu": "• Добавлена интеграция с операционными системами Windows и Linux, протестировано на: Windows 10, Kubuntu 20.04.<br>• Добавлены настройки для управления отображением уведомлений."
        }],
        ["1.3", {
            "messageEn": "• Added shortcut button to add to favorites.",
            "messageRu": " Добавлена клавиша быстрого доступа, чтобы добавить в избранное."
        }],
        ["1.2", {
            "messageEn": "• Fixed translates.<br>• Graphical improvements.",
            "messageRu": "• Исправлены переводы.<br>• Графические улучшения."
        }]
    ]
}